ProService/src/Documents/ВыплатаКриптовалютыПулом/ВыплатаКриптовалютыПулом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаКриптовалютыПулом</name>
  <registerRecords>AccumulationRegister.ВыплатыКриптовалютПулом</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Криптокошельки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пул</name>
    <type>
      <types>CatalogRef.ПулыМайнинга</types>
    </type>
  </attributes>
</mdclass:Document>

ProService/src/AccumulationRegisters/ВыплатыКриптовалютПулом/ВыплатыКриптовалютПулом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыплатыКриптовалютПулом</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>18</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пул</name>
    <type>
      <types>CatalogRef.ПулыМайнинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Криптокошельки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Timestamp</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ProService/src/Documents/ВыплатаКриптовалютыПулом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ВыплатыКриптовалютПулом 
	Движения.ВыплатыКриптовалютПулом.Записывать = Истина;
	Движение = Движения.ВыплатыКриптовалютПулом.Добавить();
	Движение.Период = Дата;
	Движение.Пул = Пул;
	Движение.Кошелек = Кошелек;
	Движение.Валюта = Валюта;
	Движение.Timestamp = Дата;
	Движение.Сумма = Сумма;
КонецПроцедуры
